UsersList/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОбрабатывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСоединенияСигур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазыЗУП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазаЗУП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

UsersList/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Организация.Наименование + " - " + Строка(Объект.ТипИнформационнойБазы) + ?(ЗначениеЗаполнено(Объект.СтрокаСоединенияСигур), " (Сигур)", "");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
	ЗаполнитьЗначенияСвойств(СткЗапроса,Объект);
	СткЗапроса.ИмяМетода = "TEST";
	Результат = ВыполнитьЗапрос(СткЗапроса);
	Если Результат <> 1 Тогда
		ПоказатьПредупреждение(,"Подключение прошло успешно!",,"ВНИМАНИЕ!!!");
	Иначе
		ПоказатьПредупреждение(,"Подключение не удалось!",,"ВНИМАНИЕ!!!");
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗапрос(СткЗапроса) Экспорт
	Соединение = Новый HTTPСоединение(
									СткЗапроса.АдресСервера, 			// сервер (хост)
									80, 					// порт, по умолчанию для http используется 80, для https 443
									СткЗапроса.Логин, 		// пользователь для доступа к серверу (если он есть) 
									СткЗапроса.Пароль,	 	// пароль для доступа к серверу (если он есть) 
									, 						// здесь указывается прокси, если он есть
									, 						// таймаут в секундах, 0 или пусто - не устанавливать
															// защищенное соединение, если используется https
									);
									
	ТекстЗапроса ="/" + СткЗапроса.НаименованиеБазы + "/hs/"+ СткЗапроса.АПИ + "/" + СткЗапроса.ИмяМетода;
	
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Ответ = Соединение.Получить(Запрос);
	КодСостояния = Ответ.КодСостояния;
	Если КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Возврат ТелоОтвета;
	Иначе
		Возврат 1;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура КомандаПроверитьGETPROZR(Команда)
	ПроверитьGETPROZR();
КонецПроцедуры

&НаСервере
Процедура ПроверитьGETPROZR()
	Ошибка = "";
	СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
	ЗаполнитьЗначенияСвойств(СткЗапроса, Объект);
	СткЗапроса.ИмяМетода = "GETPROZR";
	Результат = ОбщегоНазначения.ВыполнитьЗапрос(СткЗапроса,Ошибка);
КонецПроцедуры
